Revit 2026 API

# GlobalParametersManagerIsUniqueName Method

---

Tests whether a name is unique among existing global parameters of a given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsUniqueName(
	Document document,
	string name
)
```
```vb
Public Shared Function IsUniqueName (
	document As Document,
	name As String
) As Boolean
```
```cpp
public:
static bool IsUniqueName(
	Document^ document,
	String^ name
)
```
```fsharp
static member IsUniqueName :
        document : Document *
        name : string -> bool
```

#### Parameters

document Document
     Document in which a new parameter is to be added.
name String
     A name of a parameter being added.

#### Return Value

Boolean True if the given %name% does not exist yet among existing global parameters nof the document; False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Typically, this method is used before a new global parameters is created, for all global parameters must have their names unique in the scope of a document.

#### Reference

GlobalParametersManager Class

Autodesk.Revit.DB Namespace